20220801163852-term_rewriting_in_minikanren.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 19:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Term rewriting in miniKanren</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Term rewriting in miniKanren</h1>
<p>
Writing a goal that will apply the following rewrites to an expression:
</p>


\begin{align*}
x + x &= 2 * x\\
\log \left(\exp(x)\right) &= x
\end{align*}


<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> numbers <span style="color: #F0DFAF; font-weight: bold;">import</span> Real

<span style="color: #F0DFAF; font-weight: bold;">from</span> etuples.core <span style="color: #F0DFAF; font-weight: bold;">import</span> ExpressionTuple, etuple

<span style="color: #F0DFAF; font-weight: bold;">from</span> kanren <span style="color: #F0DFAF; font-weight: bold;">import</span> var, conde, lall
<span style="color: #F0DFAF; font-weight: bold;">from</span> kanren.constraints <span style="color: #F0DFAF; font-weight: bold;">import</span> isinstanceo

<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">single_math_reduceo</span>(expanded_term, reduced_term):
    <span style="color: #DFAF8F;">x_lv</span> = var()
    <span style="color: #F0DFAF; font-weight: bold;">return</span> lall(
        isinstanceo(x_lv, Real),
        isinstanceo(x_lv, ExpressionTuple),
        conde(
            <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">add(x, x) == mul(2, x)</span>
            [eq(expanded_term, etuple(add, x_lv, x_lv)), eq(reduced_term, etuple(mul, 2, x))],
            <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">exp(log(x)) == x</span>
            [eq(expanded_term, etuple(log, etuple(exp, x_lv))), eq(reduced_term, x_lv)],
        )
    )
</pre>
</div>

<p>
<i>TBD:</i> What this means exactly
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> functools <span style="color: #F0DFAF; font-weight: bold;">import</span> partial

<span style="color: #F0DFAF; font-weight: bold;">from</span> kanren <span style="color: #F0DFAF; font-weight: bold;">import</span> reduceo

<span style="color: #DFAF8F;">math_reduceo</span> = partial(reduceo, single_math_reduceo)
</pre>
</div>

<p>
<i>TBD:</i> This too wtf means
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> kanren.graph <span style="color: #F0DFAF; font-weight: bold;">import</span> walko

<span style="color: #DFAF8F;">math_walko</span> = partial(walko, single_math_reduceo)
</pre>
</div>

<div id="outline-container-orgd48ed5c" class="outline-2">
<h2 id="orgd48ed5c">Try a simple expansion</h2>
<div class="outline-text-2" id="text-orgd48ed5c">
<p>
We're starting from the expanded expression \(3 + 3 + \exp(\log(\exp(5)))\) and will try to get the reduced version:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">expanded_term</span>  = etuple(add, etuple(add, 3, 3), euple(exp, etuple(log, etuple(exp, 5))))
<span style="color: #DFAF8F;">reduced_term</span> = var()
</pre>
</div>
</div>
</div>
<div id="outline-container-org051d251" class="outline-2">
<h2 id="org051d251">References</h2>
</div>

<div id="outline-container-org9ed280e" class="outline-2">
<h2 id="org9ed280e">Links to this note</h2>
</div>
</div>
</body>
</html>